Tekla.Structures.ModelInternal.SpacingZone
The spacing zone class.

Tekla.Structures.ModelInternal.SpacingZone.#ctor
Initializes a new instance of the Tekla.Structures.ModelInternal.SpacingZone class.

Tekla.Structures.ModelInternal.SpacingZone.CloneSpacingZone
Clone spacing zone.
Returns: The Tekla.Structures.ModelInternal.SpacingZone.

Tekla.Structures.ModelInternal.SpacingZone.ToStruct(Tekla.Structures.ModelInternal.dotSpacingZone_t@)
The to struct method.
dotZone: The dot spacing zone struct.

Tekla.Structures.ModelInternal.SpacingZone.FromStruct(Tekla.Structures.ModelInternal.dotSpacingZone_t@)
The from struct method.
dotZone: The dot spacing zone struct.

Tekla.Structures.ModelInternal.SpacingZone.NumberOfSpaces
Gets or sets the number of spaces.

Tekla.Structures.ModelInternal.SpacingZone.Space
Gets or sets the space.

Tekla.Structures.ModelInternal.SpacingZone.Length
Gets or sets the length.

Tekla.Structures.ModelInternal.SpacingZone.NumberOfSpacesIsFixed
Gets or sets a value indicating whether number of spaces is fixed.

Tekla.Structures.ModelInternal.SpacingZone.SpaceIsFixed
Gets or sets a value indicating whether space is fixed.

Tekla.Structures.ModelInternal.SpacingZone.LengthIsFixed
Gets or sets a value indicating whether length is fixed.